Table of Contents
 Class Element2D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Representation of element2D
[OpenModelClass("CI.StructModel.Structure.Element2D,CI.StructuralElements", "CI.StructModel.Structure.IElement2D,CI.BasicTypes")]
public class Element2D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Element2D
Derived
Wall
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Element2D()
Constructor
public Element2D()
Properties
 EccentricityZ
Displacement in local axis Z
public double EccentricityZ { get; set; }
Property Value
double
 ElementType
Analysis type - shell, plate, wall
public Element2DType ElementType { get; set; }
Property Value
Element2DType
 GeometricRegion
Geometry region of element2D
public ReferenceElement GeometricRegion { get; set; }
Property Value
ReferenceElement
 InnerLines
Inner lines of this region
public List<ReferenceElement> InnerLines { get; set; }
Property Value
List<ReferenceElement>
 InnerPoints
Inner points of this region
public List<ReferenceElement> InnerPoints { get; set; }
Property Value
List<ReferenceElement>
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 Name
Name of 2D element
public string Name { get; set; }
Property Value
string
 Thickness
Thicknes of Element2D
public double Thickness { get; set; }
Property Value
double
 Edit this page